"common.ok" = "OK";
"common.cancel" = "Cancel";
"common.save" = "Save";
"common.done" = "Done";
"common.na" = "N/A";
"common.all" = "All";
"app.language" = "app.language";

"language.section" = "Language";
"language.system" = "System";
"language.english" = "English";
"language.russian" = "Russian";

"panel.title" = "UAV Digital Twin Simulator";
"panel.keyboard_hint" = "WASD/QE fly, Shift boost, 1..6 cameras, M map, / compass, arrows FPV look, +/- zoom";
"panel.workflow_hint" = "Main controls are in the top toolstrip. Use toolbar buttons to show or hide parameters.";
"panel.toggle_collapse" = "Collapse/Expand Control Panel";
"panel.collapse" = "Collapse Panel";
"panel.expand" = "Expand Panel";
"panel.parameters.on" = "Parameters: On";
"panel.parameters.off" = "Parameters: Off";
"panel.hide" = "Hide parameters panel";
"panel.show" = "Show parameters panel";
"panel.drone_profile" = "UAV Profile";
"panel.model" = "Model";
"panel.mass" = "Mass";
"panel.max_flight" = "Max flight";
"panel.max_wind" = "Wind resistance";
"panel.camera_layout" = "Camera layout";
"panel.visual_class" = "Visual class";
"panel.commands" = "Commands";
"panel.position" = "Position";
"panel.orientation" = "Orientation";
"panel.throttle" = "Throttle";
"panel.camera" = "Camera";
"panel.camera_mode" = "Camera mode";
"panel.weather" = "Weather";
"panel.terrain" = "Terrain";
"panel.diagnostics" = "Diagnostics";
"panel.fleet" = "Fleet";
"panel.damage" = "Damage & Health";
"panel.warnings" = "Warnings";
"panel.telemetry" = "Telemetry";

"axis.x" = "X";
"axis.y" = "Y";
"axis.z" = "Z";
"axis.roll" = "Roll";
"axis.pitch" = "Pitch";
"axis.yaw" = "Yaw";

"camera.mode.free" = "Free";
"camera.mode.follow" = "Tail / Chase";
"camera.mode.third_person" = "Third Person";
"camera.mode.fpv" = "FPV";
"camera.mode.orbit" = "Orbit";
"camera.mode.top" = "Top";
"camera.mode.payload" = "Payload Drop";
"camera.mode.top_down" = "Top Down";
"camera.payload.auto_switch" = "Auto-switch to payload view after release";
"camera.fov" = "FOV";
"camera.sensitivity" = "Sensitivity";
"camera.smoothing" = "Smoothing";
"camera.orbit_distance" = "Orbit distance";
"camera.follow_x" = "Follow offset X";
"camera.follow_y" = "Follow offset Y";
"camera.follow_z" = "Follow offset Z";
"camera.fpv_stabilization" = "FPV stabilization";
"camera.fpv_shake" = "FPV shake";

"command.reset" = "Reset";
"command.takeoff" = "Takeoff";
"command.land" = "Land";
"command.hover" = "Hover";
"command.auto_path" = "Auto Path";
"command.return_home" = "Return Home";
"command.emergency_stop" = "Emergency Stop";
"command.start_animation" = "Start Simulation";
"command.stop_animation" = "Stop Simulation";

"weather.normal" = "Normal";
"weather.wind" = "Wind";
"weather.rain" = "Rain";
"weather.snow" = "Snow";
"weather.fog" = "Fog";
"weather.smog" = "Smog";
"weather.thunderstorm" = "Thunderstorm";
"weather.intensity" = "Intensity";
"weather.wind_direction" = "Wind direction";
"weather.wind_speed" = "Wind speed";
"weather.gusts" = "Gusts";

"terrain.grid_demo" = "Grid Demo";
"terrain.field" = "Field";
"terrain.forest" = "Forest";
"terrain.cargo_yard" = "Cargo Yard";
"terrain.city" = "City";
"terrain.density" = "Object density";
"terrain.seed" = "Seed";
"terrain.scale" = "Map scale";
"terrain.scale.4x4" = "4x4";
"terrain.scale.8x8" = "8x8";
"terrain.scale.16x16" = "16x16";
"terrain.scale.32x32" = "32x32";
"terrain.scale.64x64" = "64x64";
"terrain.scale.128x128" = "128x128";
"terrain.scale.256x256" = "256x256";
"terrain.scale.512x512" = "512x512";
"environment.boundary_barrier_visible" = "Show boundary barrier";

"diagnostic.mode" = "Diagnostic mode";
"diagnostic.mode.normal" = "Normal view";
"diagnostic.mode.thermal" = "Thermal / Load";
"diagnostic.mode.damage" = "Damage / Integrity";
"diagnostic.collision_debug" = "Collision debug";
"diagnostic.toggle_thermal" = "Thermal Layer";
"diagnostic.toggle_damage" = "Damage Layer";
"diagnostic.fleet_mode" = "Enable fleet";

"fleet.formation" = "Formation";
"fleet.mode.off" = "Off";
"fleet.mode.line" = "Line";
"fleet.mode.triangle" = "Triangle";
"fleet.separation" = "Separation";
"fleet.wingmen" = "Wingmen";
"fleet.risk" = "Inter-drone risk";
"fleet.nearest" = "Nearest separation";

"damage.reset" = "Reset damage";
"damage.clear_selection" = "Clear selection";
"damage.hide" = "Hide";

"component.battery" = "Battery";
"component.gimbal" = "Front camera / gimbal";
"component.fc_core" = "Flight controller core";
"component.motor_fl" = "Motor FL";
"component.motor_fr" = "Motor FR";
"component.motor_rl" = "Motor RL";
"component.motor_rr" = "Motor RR";
"component.propeller_fl" = "Propeller FL";
"component.propeller_fr" = "Propeller FR";
"component.propeller_rl" = "Propeller RL";
"component.propeller_rr" = "Propeller RR";
"component.arm_fl" = "Arm FL";
"component.arm_fr" = "Arm FR";
"component.arm_rl" = "Arm RL";
"component.arm_rr" = "Arm RR";
"component.esc_power" = "ESC / power electronics";

"warning.nominal" = "OK";
"warning.warning" = "Warn";
"warning.critical" = "Crit";
"warning.collision_high" = "High collision risk";
"warning.weather_severe" = "Severe weather conditions";
"warning.battery_low" = "Low battery";
"warning.integrity_low" = "Structural integrity low";
"warning.fixedwing_low_speed" = "Fixed-wing low-speed / stall risk";
"warning.fleet_risk" = "Fleet separation risk";
"warning.interdrone_critical" = "Critical inter-drone proximity";
"warning.emergency" = "Emergency mode active";
"warnings.none" = "No active warnings";
"summary.damage.none" = "No critical damage";

"signal_loss.warning" = "Signal will be lost in %d...";
"signal_loss.lost_title" = "Signal lost";
"signal_loss.lost_message" = "The UAV has left the map bounds. Flight controls are locked until the signal is restored.";
"signal_loss.recover" = "Restore signal";

"telemetry.position" = "Position";
"telemetry.velocity" = "Velocity";
"telemetry.attitude" = "Attitude";
"telemetry.speed" = "Speed";
"telemetry.throttle" = "Throttle";
"telemetry.mode" = "Mode";
"telemetry.state" = "State";
"telemetry.battery" = "Battery";
"telemetry.power" = "Power draw";
"telemetry.remaining" = "Remaining time";
"telemetry.weather" = "Weather";
"telemetry.collision_risk" = "Collision risk";
"telemetry.nearest_obstacle" = "Nearest obstacle";
"telemetry.emergency" = "Emergency action";
"telemetry.mission_status" = "Mission status";
"telemetry.damage" = "Damage";
"telemetry.thermal" = "Thermal";
"telemetry.fleet" = "Fleet mode";
"telemetry.fleet_risk" = "Fleet risk";
"telemetry.nearest_interdrone" = "Nearest inter-drone";
"telemetry.export" = "Export Telemetry";
"telemetry.export.success" = "Telemetry exported";
"telemetry.export.failure" = "Telemetry export failed";

"mission.map.open_help" = "Mission map";
"mission.map.title" = "TACTICAL MAP";
"mission.map.subtitle" = "Fullscreen planning surface for mission typing, constraints, route preview and preflight validation";
"mission.map.exit" = "EXIT MAP";
"mission.map.clear_route" = "CLEAR ROUTE";
"mission.map.clear_drop_zone" = "CLEAR DROP ZONE";
"mission.map.clear_context" = "CLEAR CONTEXT";
"mission.map.delete_last" = "DELETE LAST";
"mission.map.clear_draft" = "CLEAR DRAFT";
"mission.map.rebuild_preview" = "REBUILD";
"mission.map.rebuild_plan" = "REBUILD PLAN";
"mission.map.cancel" = "CANCEL";
"mission.map.confirm" = "APPLY DRAFT";
"mission.map.instruction.view" = "Review bounds, obstacles, route preview and mission zones. Map clicks are disabled in this mode.";
"mission.map.instruction.route" = "Click on the map to place operational waypoints.";
"mission.map.instruction.drop_zone_center" = "Click on the map to place the payload drop zone center.";
"mission.map.instruction.drop_zone_radius" = "Adjust the drop zone radius, then rebuild or apply the draft.";
"mission.map.instruction.zone_center" = "Click on the map to place a circular no-fly zone.";
"mission.map.instruction.return_point" = "Click on the map to place the designated return point.";
"mission.map.summary.format" = "UAV %+.1f / %+.1f   HOME %+.1f / %+.1f   MAP %.0f m";
"mission.map.route.metrics.format" = "WP %d | LEN %.0f m | SEG %d | RISK %d";
"mission.map.route.validation.format" = "ETA %.0f s | CPLX %.0f%% | OBS %.0f%%";
"mission.map.route.value.format" = "WP %d | LEN %.0f m | SEG %d";
"mission.map.zones.value.format" = "ZONES %d | RISK %d";
"mission.map.drop_zone.value.format" = "CTR %+.1f / %+.1f   R %.1f m";
"mission.map.section.plan" = "MISSION PLAN";
"mission.map.section.plan.subtitle" = "Mission type, preflight return policy and current editing mode";
"mission.map.section.constraints" = "CONSTRAINTS";
"mission.map.section.constraints.subtitle" = "Altitude, speed and reserve policy before launch";
"mission.map.section.route" = "ROUTE";
"mission.map.section.route.subtitle" = "Planner output, preview validity and current route metrics";
"mission.map.section.energy" = "ENERGY";
"mission.map.section.energy.subtitle" = "Projected consumption, reserve margin and payload compatibility";
"mission.map.section.drop_zone" = "DROP ZONE";
"mission.map.section.zones" = "MISSION ZONES";
"mission.map.section.zone_radius" = "ZONE RADIUS";
"mission.map.section.validation" = "VALIDATION";
"mission.map.section.validation.subtitle" = "Launch blockers and marginal conditions detected by preflight checks";
"mission.map.section.preview_checks" = "PREVIEW CHECKS";
"mission.map.section.preview_checks.subtitle" = "Planner blockers and route-level warnings";
"mission.map.section.workflow" = "WORKFLOW";
"mission.map.section.workflow.subtitle" = "Stage-1 map tools for waypoint and zone drafting";
"mission.map.section.feasibility" = "VIABILITY";
"mission.map.section.feasibility.subtitle" = "Payload compatibility, energy reserve and planner exposure";
"mission.map.section.payload_delivery" = "PAYLOAD DELIVERY";
"mission.map.section.payload_delivery.subtitle" = "Drop automation and payload readiness state";
"mission.map.section.events" = "EVENTS";
"mission.map.section.events.subtitle" = "Recent mission log entries";
"mission.map.zone_radius.value" = "%.1f m";
"mission.map.energy.summary.format" = "USE %.0f%% | REM %.0f%% | RES %.0f%% | MRG %.0f%%";
"mission.map.feasibility.energy.format" = "USE %.0f%% | REM %.0f%% | RES %.0f%%";
"mission.map.auto_release" = "Auto release over zone center";
"mission.map.payload_ready" = "Attached payload is ready for delivery";
"mission.map.payload_unavailable" = "Delivery mission requires an attached payload";
"mission.map.events.empty" = "No mission events yet.";
"mission.map.active_drop_zone" = "ACTIVE DZ";
"mission.map.no_drop_zone" = "NO DZ";
"mission.map.active_route" = "ACTIVE ROUTE";
"mission.map.no_route" = "NO ROUTE";
"mission.map.footer_hint" = "Apply the draft to commit the validated preflight plan and keep operational overlays synchronized with the scene.";
"mission.map.no_route_target" = "No route target";
"mission.map.no_drop_zone_value" = "No drop zone";
"mission.map.mission_type" = "Mission type";
"mission.map.return_mode" = "Return mode";
"mission.map.zone_type" = "Zone type";
"mission.map.constraint.return_home" = "Require return-to-home reserve";
"mission.map.constraint.max_altitude" = "Max altitude";
"mission.map.constraint.min_altitude" = "Min altitude";
"mission.map.constraint.max_speed" = "Max speed";
"mission.map.constraint.reserve" = "Reserve policy";
"mission.map.constraint.altitude.value" = "%.1f m";
"mission.map.constraint.speed.value" = "%.1f m/s";
"mission.map.constraint.reserve.value" = "%.0f %%";
"mission.map.status.draft_dirty" = "DRAFT DIRTY";
"mission.map.status.plan_synced" = "PLAN SYNCED";

"mission.mode.navigation" = "ROUTE";
"mission.mode.view" = "VIEW";
"mission.mode.waypoint" = "WAYPOINT";
"mission.mode.drop_zone" = "DROP ZONE";
"mission.mode.zone" = "NO-FLY";
"mission.mode.return_point" = "RETURN";

"mission.type.recon" = "Recon";
"mission.type.delivery" = "Delivery";
"mission.type.observation" = "Observation";
"mission.type.relay" = "Relay";
"mission.type.free_route" = "Free route";

"mission.phase.preflight" = "PREFLIGHT";
"mission.phase.ready" = "READY";
"mission.phase.takeoff" = "TAKEOFF";
"mission.phase.transit" = "TRANSIT";
"mission.phase.approach" = "APPROACH";
"mission.phase.payload_delivery" = "PAYLOAD";
"mission.phase.return_home" = "RETURN";
"mission.phase.landing" = "LANDING";
"mission.phase.paused" = "PAUSED";
"mission.phase.completed" = "COMPLETED";
"mission.phase.aborted" = "ABORTED";

"mission.execution.status.idle" = "EXEC IDLE";
"mission.execution.status.ready" = "EXEC READY";
"mission.execution.status.running" = "EXEC RUN";
"mission.execution.status.paused" = "EXEC PAUSE";
"mission.execution.status.completed" = "EXEC DONE";
"mission.execution.status.aborted" = "EXEC ABORT";
"mission.execution.status.failedsafe" = "FAILSAFE";

"mission.command.prepare" = "Prepare Mission";
"mission.command.arm_for_mission" = "Arm for mission";
"mission.command.start" = "Start Mission";
"mission.command.pause" = "Pause Mission";
"mission.command.resume" = "Resume Mission";
"mission.command.abort" = "Abort Mission";
"mission.command.return_home" = "Return Home";
"mission.command.hold" = "Hold Position";
"mission.command.trigger_payload" = "Trigger Delivery";

"mission.abort.user" = "Mission aborted by operator.";
"mission.abort.invalid_plan" = "Mission runtime lost a valid executable plan.";
"mission.abort.low_battery" = "Mission stopped due to low battery reserve.";
"mission.abort.route_unavailable" = "Mission route is no longer available.";
"mission.abort.payload_failure" = "Payload operation failed during execution.";
"mission.abort.boundary_violation" = "Mission exited the operational boundary.";
"mission.abort.failsafe_triggered" = "Mission was interrupted by a failsafe condition.";

"mission.failsafe.hold" = "FAILSAFE HOLD";
"mission.failsafe.return_home" = "FAILSAFE RTL";
"mission.failsafe.forced_landing" = "FAILSAFE LAND";
"mission.failsafe.abort" = "FAILSAFE ABORT";

"mission.return.return_home" = "Return home";
"mission.return.hold" = "Hold position";
"mission.return.land_designated" = "Land designated";

"mission.zone.drop" = "Drop zone";
"mission.zone.no_fly" = "No-fly zone";
"mission.zone.caution" = "Caution zone";
"mission.zone.landing" = "Landing zone";
"mission.zone.observation" = "Observation zone";
"mission.zone.signal_risk" = "Signal risk zone";

"mission.feasibility.safe" = "SAFE";
"mission.feasibility.marginal" = "MARGINAL";
"mission.feasibility.unsafe" = "UNSAFE";

"mission.link.nominal" = "LINK NOMINAL";
"mission.link.degraded" = "LINK DEGRADED";
"mission.link.critical" = "LINK CRITICAL";
"mission.link.lost" = "LINK LOST";

"mission.status.map_active" = "MISSION MAP ACTIVE";
"mission.status.route_ready" = "ROUTE READY";
"mission.status.drop_zone_set" = "DROP ZONE SET";
"mission.status.delivery_ready" = "DELIVERY READY";
"mission.status.in_drop_zone" = "IN DROP ZONE";
"mission.status.payload_released" = "PAYLOAD RELEASED";

"mission.preview.status.idle" = "PREVIEW IDLE";
"mission.preview.status.valid" = "PREVIEW VALID";
"mission.preview.status.blocked" = "PREVIEW BLOCKED";
"mission.preview.message.empty" = "Add a waypoint or drop zone to produce the first route preview.";
"mission.preview.message.awaiting_rebuild" = "Draft geometry changed. Rebuild or apply the draft to refresh the planner output.";
"mission.preview.message.valid" = "Planner returned a valid route preview across the current operational area.";
"mission.preview.blocked.no_free_start_or_goal" = "Planner could not find a free start or goal cell inside the current obstacle field.";
"mission.preview.blocked.astar" = "Planner could not connect the route because the no-fly or obstacle layout blocks the path.";
"mission.preview.blocked.grid" = "Planner grid could not be prepared for the current terrain and obstacle context.";
"mission.preview.blocked.generic" = "Route preview is blocked. Adjust waypoints, zone placement or map scale and rebuild.";
"mission.plan.status.ready" = "READY";
"mission.plan.status.marginal" = "MARGINAL";
"mission.plan.status.blocked" = "BLOCKED";
"mission.validation.severity.info" = "INFO";
"mission.validation.severity.warning" = "WARNING";
"mission.validation.severity.error" = "ERROR";
"mission.validation.home_missing" = "Mission home point is invalid or unavailable.";
"mission.validation.waypoint_sequence" = "Waypoint spacing is too tight for a stable route preview.";
"mission.validation.zone_invalid" = "One or more mission zones have invalid geometry.";
"mission.validation.altitude_window" = "Mission altitude constraints are internally inconsistent.";
"mission.validation.speed_limit" = "Configured cruise speed exceeds the active vehicle limits.";
"mission.validation.route_conflict" = "Validated route conflicts with active no-fly geometry.";
"mission.validation.return_reserve" = "Projected battery reserve is insufficient for the required return policy.";

"mission.validation.no_route" = "Mission route is not defined.";
"mission.validation.delivery_requires_drop_zone" = "Delivery mission requires a configured drop zone.";
"mission.validation.payload_incompatible" = "Selected UAV / payload combination is not compatible.";
"mission.validation.delivery_requires_payload" = "Delivery mission requires an attached payload.";
"mission.validation.energy_marginal" = "Projected energy reserve is marginal.";
"mission.validation.energy_unsafe" = "Projected energy reserve is unsafe for launch.";
"mission.validation.risk_zone_intersections" = "Planned path crosses risk zones.";
"mission.validation.weather_penalty" = "Weather conditions reduce mission viability.";
"mission.payload.summary.none" = "No active payload configuration.";
"mission.payload.summary.ready" = "Payload configuration is compatible with the selected mission plan.";
"mission.payload.summary.incompatible" = "Current payload configuration is not compatible with the active airframe.";
"mission.payload.summary.delivery_missing" = "Delivery mission requires an attached payload.";

"mission.warning.link_lost" = "Mission link is lost. RTL or failsafe is required.";
"mission.warning.link_critical" = "Mission link quality is critical.";
"mission.warning.energy_low" = "Energy reserve is low. Return is recommended.";
"mission.warning.energy_critical" = "Energy reserve is critical. Forced landing may be required.";
"mission.warning.invalid_plan_runtime" = "Mission execution cannot start without a validated executable plan.";
"mission.warning.route_unavailable" = "Mission route is unavailable. Hold or re-route is required.";
"mission.warning.boundary_violation" = "Mission left the operational boundary. Return-home has been requested.";
"mission.warning.payload_not_allowed" = "Payload delivery trigger is not allowed in the current mission phase.";

"mission.event.severity.info" = "Info";
"mission.event.severity.warning" = "Warning";
"mission.event.severity.critical" = "Critical";
"mission.event.arm" = "Vehicle armed.";
"mission.event.disarm" = "Vehicle disarmed.";
"mission.event.disarm_emergency" = "Emergency disarm executed.";
"mission.event.takeoff" = "Mission takeoff initiated.";
"mission.event.landing" = "Landing sequence initiated.";
"mission.event.started" = "Mission execution started.";
"mission.event.aborted" = "Mission aborted.";
"mission.event.completed" = "Mission completed.";
"mission.event.plan_confirmed" = "Mission plan confirmed.";
"mission.event.prepared" = "Mission execution state prepared.";
"mission.event.replan" = "Mission route replanned.";
"mission.event.rtl" = "Return-to-home activated.";
"mission.event.execution_status_changed" = "Mission execution status changed.";
"mission.event.failsafe" = "Mission failsafe action engaged.";
"mission.event.emergency_stop" = "Emergency stop engaged.";
"mission.event.payload_attached" = "Payload attached.";
"mission.event.payload_removed" = "Payload removed.";
"mission.event.payload_released" = "Payload released.";
"mission.event.payload_lifecycle" = "Payload lifecycle updated.";
"mission.event.phase_changed" = "Mission phase changed.";
"mission.event.link_state_changed" = "Link state changed.";
"mission.event.link_lost" = "Mission link lost.";
"mission.event.energy_low" = "Mission energy reserve is low.";
"mission.event.energy_critical" = "Mission energy became critical.";
"mission.event.thermal_warning" = "Thermal state reached warning threshold.";
"mission.event.thermal_critical" = "Thermal state reached critical threshold.";
"mission.event.zone_enter" = "Entered mission zone.";
"mission.event.zone_exit" = "Exited mission zone.";
"mission.event.waypoint_reached" = "Waypoint reached.";
"mission.event.debrief_generated" = "Mission debrief generated.";
"mission.event.operator_command" = "Mission operator command received.";
"mission.event.category.execution" = "Execution";
"mission.event.category.navigation" = "Navigation";
"mission.event.category.payload" = "Payload";
"mission.event.category.battery" = "Battery";
"mission.event.category.thermal" = "Thermal";
"mission.event.category.safety" = "Safety";
"mission.event.category.diagnostics" = "Diagnostics";
"mission.event.category.operator" = "Operator";
"mission.event.category.system" = "System";
"mission.outcome.success" = "Success";
"mission.outcome.partial" = "Partial success";
"mission.outcome.aborted" = "Aborted";
"mission.outcome.failed" = "Failed";
"mission.outcome.failsafe_return" = "Failsafe return";
"mission.outcome.failsafe_landing" = "Failsafe landing";
"mission.debrief.verdict.success" = "Mission objectives met within expected limits.";
"mission.debrief.verdict.partial" = "Mission completed with degraded outcome or open warnings.";
"mission.debrief.verdict.aborted" = "Mission stopped by operator or supervisory control.";
"mission.debrief.verdict.failed" = "Mission did not complete its intended objective.";
"mission.debrief.verdict.failsafe_return" = "Mission terminated into a controlled failsafe return.";
"mission.debrief.verdict.failsafe_landing" = "Mission terminated into a forced failsafe landing.";

"mission.debrief.success" = "SUCCESS";
"mission.debrief.failure" = "FAILURE";
"mission.debrief.payload.not_started" = "Payload task not started";
"mission.debrief.payload.pending" = "Payload task pending";
"mission.debrief.payload.completed" = "Payload task completed";

"module.mission.title" = "Mission";
"module.mission.toolbar_title" = "Mission";
"module.mission.subtitle" = "Mission planning and validation layer over the tactical map";
"module.mission.status" = "MISSION STATUS";
"module.mission.status.subtitle" = "Committed mission plan, planner status and current map scale";
"module.mission.command_stack" = "COMMAND STACK";
"module.mission.command_stack.subtitle" = "Open the tactical map, rebuild validation or clear the saved planning state";
"module.mission.open_map" = "Open map";
"module.mission.validate_plan" = "Validate plan";
"module.mission.start" = "Start mission";
"module.mission.abort" = "Abort mission";
"module.mission.clear_plan" = "Clear plan";
"module.mission.energy" = "ENERGY ESTIMATE";
"module.mission.energy.subtitle" = "Preflight consumption, reserve margin and payload load impact";
"module.mission.preview_checks" = "PREVIEW CHECKS";
"module.mission.preview_checks.subtitle" = "Validation issues and route-level blockers detected before launch";
"module.mission.warnings" = "MISSION WARNINGS";
"module.mission.warnings.subtitle" = "Energy, link and validation warnings";
"module.mission.warnings.none" = "No active validation issues.";
"module.mission.event_log" = "EVENT LOG";
"module.mission.event_log.subtitle" = "Structured mission events";
"module.mission.events.none" = "No mission events recorded.";
"module.mission.events.clear_view" = "Clear view";
"module.mission.events.show_all" = "Show all";
"module.mission.debrief" = "POST-FLIGHT DEBRIEF";
"module.mission.debrief.subtitle" = "Mission result and engineering summary";
"module.mission.metric.type" = "Type";
"module.mission.metric.scale" = "Scale";
"module.mission.metric.status" = "Status";
"module.mission.metric.phase" = "Phase";
"module.mission.metric.link" = "Link";
"module.mission.metric.distance" = "Distance";
"module.mission.metric.current_waypoint" = "Waypoint";
"module.mission.metric.remaining" = "Remaining";
"module.mission.metric.reserve" = "Reserve";
"module.mission.metric.energy_use" = "Use";
"module.mission.metric.energy_remaining" = "Remaining";
"module.mission.metric.flight_time" = "ETA";
"module.mission.metric.eta" = "ETA";
"module.mission.metric.payload" = "Payload";
"module.mission.metric.waypoints" = "Waypoints";
"module.mission.metric.zones" = "Zones";
"module.mission.preview.empty" = "No saved route preview yet. Open the map and apply a draft route.";
"module.mission.debrief.result" = "Result";
"module.mission.debrief.duration" = "Duration";
"module.mission.debrief.distance" = "Distance";
"module.mission.debrief.energy" = "Energy";

"module.diagnostics.mission_status" = "MISSION STATUS";
"module.diagnostics.mission_status.subtitle" = "Mission phase, link and warning contour";
"module.diagnostics.mission_events" = "MISSION EVENTS";
"module.diagnostics.mission_events.subtitle" = "Recent operational log entries";
"module.diagnostics.mission_debrief" = "MISSION DEBRIEF";
"module.diagnostics.mission_debrief.subtitle" = "Post-flight outcome summary";

"hud.title" = "Telemetry HUD";
"hud.telemetry" = "Telemetry";
"hud.camera" = "Camera";
"hud.drone" = "Drone";

"mode.manual" = "Manual";
"mode.auto_path" = "Auto Path";
"mode.return_home" = "Return Home";
"mode.hover" = "Hover";
"mode.emergency_stop" = "Emergency Stop";
"mode.takeoff" = "Takeoff";
"mode.landing" = "Landing";

"flight_state.on_ground" = "On ground";
"flight_state.battery_depleted" = "Battery depleted";
"flight_state.ascending" = "Ascending";
"flight_state.descending" = "Descending";
"flight_state.emergency" = "Emergency";
"flight_state.stable" = "Stable";
"flight_state.climbing" = "Climbing";
"flight_state.cruise" = "Cruise";

"emergency.none" = "None";
"emergency.slow_down" = "Slow down";
"emergency.hover" = "Hover";
"emergency.avoid" = "Avoid";
"emergency.stop" = "Emergency stop";

"battery.depleted.title" = "Battery depleted";
"battery.depleted.message" = "Battery is fully depleted. Choose how to continue simulation.";
"battery.depleted.charge" = "Charge drone";
"battery.depleted.restart" = "Restart scenario";

"abstract.edit" = "Edit Parameters";
"abstract.editor.title" = "Abstract UAV Parameters";
"abstract.editor.mass" = "Mass";
"abstract.editor.dimensions" = "Dimensions";
"abstract.editor.energy" = "Energy and Limits";
"abstract.editor.control" = "Control";
"abstract.validation.vertical" = "Ascent/descent speeds are too low.";
"abstract.validation.speed" = "Horizontal speed must be >= ascent/descent speeds.";
"abstract.validation.radius" = "Collision radius is too large for selected dimensions.";

"drone.model.lipo_scout4" = "LIPO Scout 4";
"drone.model.lipo_vector3s" = "LIPO Vector 3S";
"drone.model.lipo_atlas3pro" = "LIPO Atlas 3 Pro";
"drone.model.abstract" = "Abstract UAV";

"drone.visual.mini" = "Light compact quadcopter";
"drone.visual.vector" = "Mid-size dual-camera quadcopter";
"drone.visual.atlas" = "Larger professional quadcopter";
"drone.visual.abstract" = "Custom abstract profile";

"drone.camera.single_compact" = "Single compact front gimbal";
"drone.camera.dual_front" = "Dual front camera module";
"drone.camera.triple_front" = "Triple front camera module";
"drone.camera.custom" = "Custom editable camera module";

"ui.toggle_telemetry_hud" = "Toggle compact telemetry HUD";

"camera.zoom_sensitivity" = "Zoom sensitivity";
"camera.free_speed" = "Free camera speed";
"camera.distance" = "Camera distance";
"camera.fpv_yaw_limit" = "FPV yaw limit";
"camera.fpv_pitch_limit" = "FPV pitch limit";
"camera.fpv_near_clip" = "FPV near clip";
"camera.fpv_mount_x" = "FPV mount X";
"camera.fpv_mount_y" = "FPV mount Y";
"camera.fpv_mount_z" = "FPV mount Z";
"camera.fpv_hide_obstructing" = "Hide obstructing drone parts in FPV";

"keybind.section.title" = "Key bindings";
"keybind.open" = "Bindings";
"keybind.category.flight" = "Flight controls";
"keybind.category.camera" = "Camera controls";
"keybind.category.ui" = "UI controls";
"keybind.category.debug" = "Debug / overlays";
"keybind.flight.forward" = "Forward";
"keybind.flight.backward" = "Backward";
"keybind.flight.left" = "Left";
"keybind.flight.right" = "Right";
"keybind.flight.descend" = "Descend";
"keybind.flight.ascend" = "Ascend";
"keybind.flight.yaw_left" = "Yaw left";
"keybind.flight.yaw_right" = "Yaw right";
"keybind.flight.accelerate" = "Accelerate";
"keybind.flight.hover" = "Hover / stabilize";
"keybind.flight.reset" = "Reset drone";
"keybind.camera.mode1" = "Camera 1 (Free)";
"payload.select" = "Payload";
"payload.configure" = "Payload Config";
"payload.toolbar.open" = "Open payload console";
"payload.toolbar.close" = "Close payload console";
"payload.section" = "PAYLOAD CONFIG";
"payload.console.subtitle" = "Mission payload console for the active UAV profile";
"payload.type" = "Payload Type";
"payload.data_source" = "Payload Data Source";
"payload.data.verified" = "VERIFIED";
"payload.data.estimated" = "ESTIMATED";
"payload.data.custom" = "CUSTOM";
"payload.data.estimated_hint" = "Estimated values are used where official payload specs are missing.";
"payload.mass" = "Payload Mass";
"payload.custom_name" = "Custom Name";
"payload.status" = "Payload Status";
"payload.mount.title" = "Mount";
"payload.mount.unavailable" = "UNAVAILABLE";
"payload.mount.ready" = "READY";
"payload.mount.occupied" = "OCCUPIED";
"payload.limits.title" = "UAV Limits";
"payload.base_mass" = "Base Mass";
"payload.battery_mass" = "Battery Mass";
"payload.max_payload" = "Payload Limit";
"payload.max_takeoff" = "Max Takeoff Mass";
"payload.total_mass" = "Total Mass";
"payload.attach" = "Attach";
"payload.release" = "Release";
"payload.remove" = "Remove";
"payload.mass_value" = "%.2f kg";
"payload.state.no_payload" = "NO PAYLOAD";
"payload.state.attached" = "ATTACHED";
"payload.state.removed" = "REMOVED";
"payload.state.released" = "RELEASED";
"payload.state.falling" = "FALLING";
"payload.state.landed" = "LANDED";
"payload.state.cleaned_up" = "CLEANED UP";
"payload.message.attached" = "Payload attached";
"payload.message.released" = "Payload released";
"payload.message.dropped_successfully" = "Payload dropped successfully";
"payload.message.cleanup_completed" = "Payload cleanup completed";
"payload.message.removed" = "Payload removed";
"payload.message.no_payload_attached" = "No payload attached";
"payload.message.select_uav" = "Select UAV first";
"payload.message.payload_limit_exceeded" = "Payload exceeds UAV payload limit";
"payload.message.takeoff_limit_exceeded" = "Total mass exceeds max takeoff mass";
"payload.message.data_unavailable" = "Payload data unavailable for this UAV profile";
"payload.message.invalid_mass" = "Set a payload mass greater than zero";
"payload.type.cargo_box" = "Cargo Box";
"payload.type.camera_gimbal" = "Camera Gimbal";
"payload.type.thermal_camera" = "Thermal Camera";
"payload.type.lidar_module" = "LiDAR Module";
"payload.type.rescue_pack" = "Rescue Pack";
"payload.type.sensor_module" = "Sensor Module";
"payload.type.radio_relay" = "Radio Relay";
"payload.type.custom" = "Custom";
"payload.placeholder.message" = "This function will be added later.";
"control_mode.angle" = "Angle";
"command.arm" = "Arm";
"command.disarm" = "Disarm";
"telemetry.arm_state" = "Arm state";
"arm_state.armed" = "Armed";
"arm_state.disarmed" = "Disarmed";
"flight_state.disarmed" = "Disarmed";
"flight_state.armed_idle" = "Armed Idle";
"flight_state.crashed" = "Crashed";
"warning.disarmed" = "Aircraft is disarmed";
"warning.integrity_critical" = "Critical structural damage";
"warning.crashed" = "Aircraft crashed";
"damage.severity.nominal" = "Nominal";
"damage.severity.light" = "Light";
"damage.severity.medium" = "Medium";
"damage.severity.critical" = "Critical";
"keybind.camera.mode2" = "Camera 2 (Chase)";
"keybind.camera.mode3" = "Camera 3 (Orbit)";
"keybind.camera.mode4" = "Camera 4 (FPV)";
"keybind.camera.mode5" = "Camera 5 (Top)";
"keybind.camera.mode6" = "Camera 6 (Payload Drop)";
"keybind.camera.toggle_fpv" = "Toggle FPV";
"keybind.camera.cycle_mode" = "Cycle camera mode";
"keybind.camera.zoom_in" = "Zoom in";
"keybind.camera.zoom_out" = "Zoom out";
"keybind.camera.yaw_left" = "Yaw left (camera)";
"keybind.camera.yaw_right" = "Yaw right (camera)";
"keybind.camera.pitch_up" = "Pitch up (camera)";
"keybind.camera.pitch_down" = "Pitch down (camera)";
"keybind.camera.reset_orientation" = "Reset camera orientation";
"workspace.toolstrip" = "Toolstrip";
"toolstrip.tab.simulation" = "Simulation";
"toolstrip.tab.flight" = "Flight";
"toolstrip.tab.camera" = "Camera";
"toolstrip.tab.environment" = "Environment";
"toolstrip.tab.debug" = "Debug";
"toolstrip.tab.projects" = "Projects";
"toolstrip.section.run" = "Run Control";
"toolstrip.section.flight_model" = "Airframe & Control";
"toolstrip.section.throttle" = "Throttle";
"toolstrip.section.camera_modes" = "Camera Modes";
"toolstrip.section.camera_quick" = "Camera Presets";
"toolstrip.section.weather" = "Weather";
"toolstrip.section.terrain" = "Terrain";
"toolstrip.section.debug" = "Diagnostics";
"toolstrip.section.projects" = "Project Actions";
"camera.zoom_in" = "Zoom +";
"camera.zoom_out" = "Zoom -";
"camera.reset_orientation" = "Reset View";
"panel.collision_debug" = "Collision Debug";
"window.fullscreen" = "Fullscreen";
"keybind.ui.toggle_panel" = "Collapse / expand panel";
"keybind.ui.toggle_hud" = "Toggle telemetry HUD";
"keybind.flight.release_payload" = "Release payload";
"keybind.debug.toggle_damage" = "Toggle damage overlay";
"keybind.debug.toggle_thermal" = "Toggle thermal overlay";
"keybind.capture.idle" = "Select an action and press Rebind.";
"keybind.capture.prompt" = "Press a key for \"%@\" (Esc to cancel)";
"keybind.rebind" = "Rebind";
"keybind.capturing" = "Listening…";
"keybind.reset_defaults" = "Reset Defaults";
"keybind.key.space" = "Space";
"keybind.key.code" = "Key %d";

"control_mode.title" = "Flight control mode";
"control_mode.stabilized" = "Stabilized";
"control_mode.acro" = "Acro";
"control_mode.hover_assist" = "Hover Assist";

"common.export" = "Export";

"camera.preset" = "Camera preset";
"camera.preset.cinematic" = "Cinematic";
"camera.preset.pilot" = "Pilot";
"camera.preset.inspection" = "Inspection";
"camera.preset.wide_follow" = "Wide Follow";
"camera.preset.tight_follow" = "Tight Follow";
"camera.preset.fpv" = "FPV";
"camera.reset_to_preset" = "Reset To Preset";
"camera.advanced" = "Advanced Camera";
"camera.invert_x" = "Invert X";
"camera.invert_y" = "Invert Y";
"camera.sensitivity_profile" = "Sensitivity profile";
"camera.sensitivity.low" = "Low";
"camera.sensitivity.medium" = "Medium";
"camera.sensitivity.high" = "High";

"section.flight" = "Flight";
"section.camera" = "Camera";
"section.environment" = "Environment";
"section.diagnostics" = "Diagnostics";
"section.advanced" = "Advanced";

"diagnostic.last_collision_source" = "Last collision source";
"diagnostic.active_objects" = "Active objects";
"diagnostic.active_physics" = "Active physics bodies";
"diagnostic.active_particles" = "Active particles";

"telemetry.control_mode" = "Control mode";
"telemetry.nearest_obstacle_source" = "Nearest obstacle source";
"telemetry.frame_time" = "Frame";
"telemetry.physics_time" = "Physics";
"telemetry.render_time" = "Render";
"telemetry.path_time" = "Pathfinding";
"telemetry.active_objects" = "Objects";
"telemetry.active_physics_bodies" = "Physics bodies";
"telemetry.particle_count" = "Particles";

"drone.model.fixed_rect" = "Rectangular Wing UAV";
"drone.model.fixed_delta" = "Delta Wing UAV";
"drone.model.fixed_swept" = "Swept Wing UAV";
"drone.visual.fixed_rect" = "Rectangular fixed-wing";
"drone.visual.fixed_delta" = "Delta fixed-wing";
"drone.visual.fixed_swept" = "Swept fixed-wing";
"drone.camera.fixed_front" = "Fixed front camera";

"menu.title" = "UAV Projects";
"menu.saved_projects" = "Saved Projects";
"menu.create_project" = "Create Project";
"menu.recent_project" = "Recent Project";
"menu.search" = "Search project";
"menu.sort" = "Sort";

"project.name" = "Project name";
"project.sort.newest" = "Newest";
"project.sort.name" = "Name";
"project.sort.recent" = "Recently Opened";
"project.create.title" = "Create Project";
"project.create.action" = "Create";
"project.open.action" = "Open Project Browser";
"project.open.failure" = "Failed to open project";
"project.save.action" = "Save Project";
"project.save_as.action" = "Save Project As";
"project.save_as.title" = "Save Project As";
"project.save_as.action" = "Save As";
"project.save.success" = "Project saved";
"project.save.failure" = "Project save failed";
"project.duplicate.title" = "Duplicate Project";
"project.duplicate.action" = "Duplicate Project";
"project.duplicate.success" = "Project duplicated";
"project.duplicate.failure" = "Project duplication failed";
"project.delete.action" = "Delete Project";
"project.delete.failure" = "Failed to delete project";
"project.delete.confirm.title" = "Delete Project";
"project.delete.confirm.message" = "Delete project '%@'?";

"project.unsaved.title" = "Unsaved Changes";
"project.unsaved.message" = "Do you want to save project '%@'?\nUnsaved changes may be lost.";
"project.unsaved.save" = "Save";
"project.unsaved.save_exit" = "Save and Exit";
"project.unsaved.exit_without" = "Exit Without Saving";

"telemetry.export.select_folder" = "Choose export folder for telemetry file.";
"control_mode.acro" = "Acro / Rate";
"control_mode.hover_assist" = "Hover / Alt-Hold";

"section.flight" = "Flight";
"section.camera" = "Camera";
"section.environment" = "Environment";
"section.diagnostics" = "Diagnostics";
"section.advanced" = "Advanced";

"camera.preset" = "Camera preset";
"camera.preset.cinematic" = "Cinematic";
"camera.preset.pilot" = "Pilot";
"camera.preset.inspection" = "Inspection";
"camera.preset.wide_follow" = "Wide Follow";
"camera.preset.tight_follow" = "Tight Follow";
"camera.preset.fpv" = "FPV";
"camera.reset_to_preset" = "Reset to preset";
"camera.advanced" = "Advanced Camera";
"camera.sensitivity_profile" = "Sensitivity profile";
"camera.sensitivity.low" = "Low";
"camera.sensitivity.medium" = "Medium";
"camera.sensitivity.high" = "High";
"camera.invert_x" = "Invert X";
"camera.invert_y" = "Invert Y";

"diagnostic.last_collision_source" = "Last collision source";
"diagnostic.active_objects" = "Active objects";
"diagnostic.active_physics" = "Active physics bodies";
"diagnostic.active_particles" = "Particle count";

"telemetry.control_mode" = "Control mode";
"telemetry.nearest_obstacle_source" = "Nearest obstacle source";
"telemetry.frame_time" = "Frame time";
"telemetry.physics_time" = "Physics update";
"telemetry.render_time" = "Render update";
"telemetry.path_time" = "Pathfinding";
"telemetry.active_objects" = "Active objects";
"telemetry.active_physics_bodies" = "Physics bodies";
"telemetry.particle_count" = "Particles";

"drone.model.fixed_rect" = "Rectangular Wing UAV";
"drone.model.fixed_delta" = "Delta Wing UAV";
"drone.model.fixed_swept" = "Swept Wing UAV";
"drone.model.ebee_class" = "eBee-class Mapping UAV";
"drone.model.ux11_class" = "UX11-class Survey UAV";
"drone.model.wingtra_class" = "Wingtra-class VTOL UAV";
"drone.model.trinity_class" = "Trinity-class Pro UAV";

"drone.visual.fixed_rect" = "Fixed-wing rectangular family";
"drone.visual.fixed_delta" = "Fixed-wing delta family";
"drone.visual.fixed_swept" = "Fixed-wing swept family";
"drone.visual.ebee_class" = "Tailless flying-wing mapping platform";
"drone.visual.ux11_class" = "Conventional survey fixed-wing platform";
"drone.visual.wingtra_class" = "Tailsitter VTOL fixed-wing platform";
"drone.visual.trinity_class" = "Professional survey eVTOL platform";

"drone.camera.fixed_front" = "Fixed-wing front camera";

"common.not_specified" = "Not specified";

"country.china" = "China";
"country.united_states" = "United States";
"country.norway" = "Norway";
"country.switzerland" = "Switzerland";
"country.germany" = "Germany";
"country.israel" = "Israel";
"country.poland" = "Poland";
"country.canada" = "Canada";
"country.user_defined" = "User Defined";

"uav.filter.type" = "Type";
"uav.filter.mass" = "Mass";
"uav.filter.vehicle.all" = "All";
"uav.filter.vehicle.multicopters" = "Multicopters";
"uav.filter.vehicle.helicopters" = "Helicopters";
"uav.filter.vehicle.fixed_wing" = "Fixed-Wing";
"uav.filter.vehicle.hybrid_vtol" = "Hybrid VTOL";
"uav.filter.mass.all" = "All";
"uav.filter.mass.nano" = "Nano";
"uav.filter.mass.micro" = "Micro";
"uav.filter.mass.light" = "Light";
"uav.filter.mass.medium" = "Medium";
"uav.filter.mass.heavy" = "Heavy";

"uav.vehicle.multicopter" = "Multicopter";
"uav.vehicle.fixed_wing" = "Fixed-Wing";
"uav.vehicle.hybrid_vtol" = "Hybrid VTOL";
"uav.vehicle.helicopter" = "Helicopter";
"uav.vehicle.custom" = "Custom";

"uav.mass.nano" = "Nano";
"uav.mass.micro" = "Micro";
"uav.mass.light" = "Light";
"uav.mass.medium" = "Medium";
"uav.mass.heavy" = "Heavy";
"uav.mass.custom" = "Custom";

"uav.spec.verified" = "Verified";
"uav.spec.partial" = "Partial";
"uav.spec.custom" = "Custom";

"uav.badge.custom" = "CUSTOM";
"uav.catalog.title" = "UAV Catalog";
"uav.catalog.empty" = "No UAV profiles match the current filters.";
"uav.catalog.edit_abstract" = "Edit Abstract UAV";
"uav.catalog.selected_outside_filter" = "Selected model is outside current filter";

"uav.card.title" = "Selected UAV";
"uav.card.manufacturer" = "Manufacturer";
"uav.card.country" = "Country";
"uav.card.type" = "Type";
"uav.card.mass_class" = "Mass class";
"uav.card.base_mass" = "Base mass";
"uav.card.max_payload" = "Max payload";
"uav.card.mtow" = "MTOW";
"uav.card.role" = "Role";
"uav.card.status" = "Status";
"uav.card.payload_data_source" = "Payload data";
"uav.card.armament_note" = "Armament note";
"uav.card.empty" = "No selected UAV profile";

"uav.manufacturer.custom" = "Custom";

"uav.profile.abstract-uav.display_name" = "Abstract UAV";
"uav.profile.dji-matrice-350-rtk.short_description" = "Enterprise quadcopter with landing gear, central gimbal bay, and modular payload support.";
"uav.profile.dji-matrice-350-rtk.mission_role" = "Enterprise inspection, mapping, and public-safety operations";
"uav.profile.dji-flycart-30.short_description" = "Heavy cargo multicopter with coaxial lift groups and a central underslung freight bay.";
"uav.profile.dji-flycart-30.mission_role" = "Cargo transport and logistics";
"uav.profile.dji-mavic-4-pro.short_description" = "Foldable consumer camera multicopter with a triple-camera forward gimbal section.";
"uav.profile.dji-mavic-4-pro.mission_role" = "Consumer aerial imaging and creator capture";
"uav.profile.dji-neo.short_description" = "Ultra-compact protected-prop multicopter designed as a lightweight personal flying camera.";
"uav.profile.dji-neo.mission_role" = "Personal aerial video capture";
"uav.profile.dji-phantom-3-standard.short_description" = "Classic Phantom consumer quadcopter with integrated landing gear and a front gimbal camera bay.";
"uav.profile.dji-phantom-3-standard.mission_role" = "Consumer aerial imaging";
"uav.profile.freefly-alta-x.short_description" = "Heavy-lift open-frame cinema and industrial multirotor with a central underslung payload section.";
"uav.profile.freefly-alta-x.mission_role" = "Heavy-lift cinema and industrial payload carriage";
"uav.profile.griff-30.short_description" = "Heavy-lift cargo UAV with a large transport frame and an underslung load zone.";
"uav.profile.griff-30.mission_role" = "Heavy-lift cargo transport";
"uav.profile.griff-60.short_description" = "Large heavy-lift cargo UAV with a higher-capacity airframe than Griff 30.";
"uav.profile.griff-60.mission_role" = "Heavy-lift cargo transport";
"uav.profile.avidrone-490tl.short_description" = "Tandem-rotor cargo UAV with a long central fuselage and underslung freight position.";
"uav.profile.avidrone-490tl.mission_role" = "Cargo transport and utility lift";
"uav.profile.wingtraone-gen-ii.short_description" = "Hybrid VTOL mapping aircraft with a belly survey compartment and fixed-wing cruise layout.";
"uav.profile.wingtraone-gen-ii.mission_role" = "Survey mapping and photogrammetry";
"uav.profile.quantum-systems-trinity-pro.short_description" = "Long-span eVTOL survey aircraft with a central sensor compartment under the fuselage.";
"uav.profile.quantum-systems-trinity-pro.mission_role" = "Survey mapping and corridor inspection";
"uav.profile.mq-9b-skyguardian.short_description" = "Large MALE fixed-wing platform with long wings, nose sensor architecture, and multi-hardpoint payload capacity.";
"uav.profile.mq-9b-skyguardian.mission_role" = "Long-endurance ISR and multi-mission patrol";
"uav.profile.hermes-900.short_description" = "Multi-role MALE UAV with a long wing, pusher layout, and sensor stations under the nose and fuselage.";
"uav.profile.hermes-900.mission_role" = "Multi-role MALE ISR and maritime patrol";
"uav.profile.ft5-los.short_description" = "Twin-engine tactical fixed-wing platform with a compact surveillance airframe and modular payload integration.";
"uav.profile.ft5-los.mission_role" = "Tactical reconnaissance and ISTAR";
"uav.profile.flyeye.short_description" = "Lightweight fixed-wing observation UAV with a compact fuselage and underbelly electro-optical payload zone.";
"uav.profile.flyeye.mission_role" = "Close-range reconnaissance and observation";
"uav.profile.abstract-uav.short_description" = "User-defined custom UAV profile kept for future parameter tuning.";
"uav.profile.abstract-uav.mission_role" = "User-defined custom mission";

"telemetry.path_status" = "Path status";
"telemetry.path_status.idle" = "Idle";
"telemetry.path_status.valid" = "Valid";
"telemetry.path_status.recomputing" = "Recomputing";
"telemetry.path_status.blocked" = "Blocked";
"telemetry.auto_nav" = "Auto nav";
"telemetry.auto_nav.active" = "ACTIVE";
"telemetry.auto_nav.inactive" = "INACTIVE";
"telemetry.control_authority" = "Control authority";
"telemetry.input_flags" = "Input flags";
"telemetry.state_flags" = "State flags";
"common.on" = "ON";
"common.off" = "OFF";
"telemetry.target_distance" = "Dist to target";
"telemetry.target_bearing" = "Bearing to target";
"telemetry.waypoint" = "Waypoint";
"telemetry.waypoint.value" = "idx %d, left %d";
"telemetry.path_remaining" = "Path remaining";

"panel.modules.on" = "Modules: On";
"panel.modules.off" = "Modules: Off";

"toolbar.cluster.status" = "Live Status";
"toolbar.cluster.status.subtitle" = "Current mission stack and active module";
"toolbar.cluster.project" = "Project Actions";
"toolbar.cluster.project.subtitle" = "Session persistence and workspace control";
"toolbar.cluster.utility" = "Operator Tools";
"toolbar.cluster.utility.subtitle" = "Bindings, HUD and language";

"sidebar.metric.mode" = "Mode";
"sidebar.metric.state" = "State";
"sidebar.metric.camera" = "Camera";
"sidebar.metric.platform" = "Platform";
"sidebar.metric.battery" = "Battery";
"sidebar.metric.warnings" = "Warnings";
"sidebar.metric.throttle" = "Throttle";
"sidebar.metric.preset" = "Preset";
"sidebar.metric.fov" = "FOV";
"sidebar.metric.distance" = "Distance";
"sidebar.metric.weather" = "Weather";
"sidebar.metric.terrain" = "Terrain";
"sidebar.metric.wind" = "Wind";
"sidebar.metric.boundary" = "Boundary";
"sidebar.metric.manufacturer" = "Manufacturer";
"sidebar.value.on" = "On";
"sidebar.value.off" = "Off";

"toolbar.header.project" = "Project actions";

"module.panel.idle" = "MODULES";
"module.panel.idle.subtitle" = "Select a tool from the toolbar to open a control module";

"module.flight_ops.title" = "FLIGHT OPS";
"module.flight_ops.toolbar_title" = "Flight";
"module.flight_ops.subtitle" = "Launch, recovery and thrust control";
"module.flight_ops.command_stack" = "Command Stack";
"module.flight_ops.command_stack.subtitle" = "Primary airframe actions and automatic routines";
"module.flight_ops.control_law" = "Flight Control";
"module.flight_ops.control_law.subtitle" = "Switch between control laws without leaving the scene";
"module.flight_ops.active_mode" = "ACTIVE";
"module.flight_ops.thrust" = "Thrust Channel";
"module.flight_ops.thrust.subtitle" = "Direct throttle authority and fixed setpoints";
"module.flight_ops.override" = "Safety / Reset";
"module.flight_ops.override.subtitle" = "Simulation power state, recovery and emergency stop";

"module.uav_catalog.title" = "UAV CATALOG";
"module.uav_catalog.toolbar_title" = "UAV";
"module.uav_catalog.subtitle" = "Platform selection and active airframe context";
"module.uav_catalog.selection" = "Platform Snapshot";
"module.uav_catalog.selection.subtitle" = "Filtered catalog status and current selection";
"module.uav_catalog.metric.active" = "Active Profile";
"module.uav_catalog.metric.filtered" = "Filtered Set";
"module.uav_catalog.metric.type" = "Vehicle Type";
"module.uav_catalog.metric.mass" = "Mass Class";
"module.uav_catalog.list.subtitle" = "Catalog filters, platform list and profile card";

"module.payload.title" = "PAYLOAD";
"module.payload.toolbar_title" = "Payload";

"module.camera.title" = "CAMERA";
"module.camera.toolbar_title" = "Camera";
"module.camera.subtitle" = "Sensor viewpoint, optics and FPV tuning";
"module.camera.mode_stack" = "Mode Stack";
"module.camera.mode_stack.subtitle" = "Operational camera modes for scene control";
"module.camera.active_mode" = "LIVE";
"module.camera.presets" = "Preset Rack";
"module.camera.presets.subtitle" = "Mission-specific camera presets and reset controls";
"module.camera.optics" = "Optics";
"module.camera.optics.subtitle" = "Distance and field-of-view tuning";
"module.camera.advanced.subtitle" = "Expand only when deeper camera tuning is required";
"module.camera.show_advanced" = "Show advanced camera tuning";
"module.camera.hide_advanced" = "Hide advanced camera tuning";
"module.camera.fpv_stack" = "FPV Calibration";
"module.camera.preset_hint.cinematic" = "Wide, smooth and presentation-focused";
"module.camera.preset_hint.pilot" = "Balanced operator view for general flying";
"module.camera.preset_hint.inspection" = "Closer framing for structure checks";
"module.camera.preset_hint.wide_follow" = "Longer chase spacing for situational awareness";
"module.camera.preset_hint.tight_follow" = "Closer chase spacing for precision work";
"module.camera.preset_hint.fpv" = "Cockpit view with direct alignment";

"module.scenario.title" = "SCENARIO";
"module.scenario.toolbar_title" = "Scenario";
"module.scenario.subtitle" = "Weather, terrain and boundary envelope";
"module.scenario.weather" = "Weather Profile";
"module.scenario.weather.subtitle" = "Preset severity and wind conditions";
"module.scenario.show_weather_tuning" = "Show wind tuning";
"module.scenario.hide_weather_tuning" = "Hide wind tuning";
"module.scenario.active_preset" = "LIVE";
"module.scenario.terrain" = "Terrain Profile";
"module.scenario.terrain.subtitle" = "Map scale, density and containment controls";
"module.scenario.active_profile" = "LIVE";

"module.diagnostics.title" = "DIAGNOSTICS";
"module.diagnostics.toolbar_title" = "Diagnostics";
"module.diagnostics.subtitle" = "Telemetry, runtime states and technical health";
"module.diagnostics.overlay" = "Overlay Modes";
"module.diagnostics.overlay.subtitle" = "Runtime rendering and debug visibility controls";
"module.diagnostics.runtime_summary" = "Runtime Summary";
"module.diagnostics.runtime_summary.subtitle" = "Frame, physics, render and object load counters";
"module.diagnostics.telemetry" = "Telemetry Rack";
"module.diagnostics.telemetry.subtitle" = "Expanded mission, power and performance readout";
"module.diagnostics.warning_bus" = "Warning Bus";
"module.diagnostics.warning_bus.subtitle" = "Current alarms from flight, battery and environment";
"module.diagnostics.fleet" = "Fleet Coordination";
"module.diagnostics.fleet.subtitle" = "Wingman behavior and formation spacing";
"module.diagnostics.damage" = "Damage / Thermal";
"module.diagnostics.damage.subtitle" = "Component visibility and integrity inspection";
"module.diagnostics.station" = "Station Settings";
"module.diagnostics.station.subtitle" = "Operator language and local workstation preferences";
"module.diagnostics.panel.overview" = "Overview";
"module.diagnostics.panel.mission" = "Mission";
"module.diagnostics.panel.telemetry" = "Telemetry";
"module.diagnostics.panel.fleet" = "Fleet";
"module.diagnostics.panel.service" = "Service";
"module.diagnostics.mission.latest_critical" = "Latest critical";
"module.diagnostics.mission.latest_warning" = "Latest warning";
"module.mission.metric.distance_remaining" = "Remaining";
"module.mission.metric.eta_remaining" = "ETA";
"module.mission.metric.outcome" = "Outcome";
"module.mission.timeline.events" = "Events";
"module.mission.timeline.warnings" = "Warnings";
"module.mission.timeline.critical" = "Critical";
"module.mission.debrief.verdict" = "Verdict";
"module.mission.debrief.key_warnings" = "Key warnings";
"module.mission.debrief.critical_log" = "Condensed incidents";

"project.default_name" = "Project %@";
"project.copy_suffix" = "Copy";
"project.clone_suffix" = "Clone";

"control_authority.none" = "NONE";
"control_authority.manual" = "MANUAL";
"control_authority.marker" = "MARKER";
"control_authority.failsafe" = "FAILSAFE";
"control_authority.blocked" = "BLOCKED";

"payload_camera.state.inactive" = "INACTIVE";
"payload_camera.state.falling" = "FALLING";
"payload_camera.state.impact" = "IMPACT";
"payload_camera.state.rest" = "AT REST";

"overlay.payload_view.title" = "PAYLOAD VIEW";
"overlay.payload_view.metric.alt" = "ALT";
"overlay.payload_view.metric.vertical_speed" = "V/S";
"overlay.payload_view.metric.time" = "TIME";
"overlay.payload_view.metric.state" = "STATE";

"overlay.terrain_map.title" = "TERRAIN MAP";
"overlay.terrain_map.subtitle" = "Filtered obstacle overview and single target marker";
"overlay.terrain_map.clear" = "CLR";
"overlay.terrain_map.target_metrics.empty" = "DST —   BRG —";
"overlay.terrain_map.target_metrics.format" = "DST %.1f m   BRG %03.0f°";
"overlay.terrain_map.heading_alt_objects.format" = "HDG %@°   ALT %.1f m   OBJ %d";
"overlay.terrain_map.position_map.format" = "X %+.1f   Z %+.1f   MAP %@";
"overlay.terrain_map.status.format" = "SIG %@   AUTO NAV %@";

"overlay.compass.title" = "COMPASS";
"overlay.compass.subtitle" = "Heading / north / target bearing";
"overlay.compass.metric.heading" = "HDG";
"overlay.compass.metric.north" = "N";
"overlay.compass.metric.bearing" = "BRG";
"overlay.compass.marker.current" = "HDG";
"overlay.compass.marker.target" = "TGT";

"hud.compact.position" = "POS  x %.1f  y %.1f  z %.1f";
"hud.compact.speed_battery" = "SPD  %.1f m/s   BAT %.0f%%";
"hud.compact.auto_nav" = "AUTO %@  DST %@  BRG %@";

"telemetry.flags.input.format" = "MAN %@ | MRK %@ | PV %@ | MAP %@";
"telemetry.flags.state.format" = "DIS %@ | BLK %@ | SIG %@";
"telemetry.flags.mission.format" = "MAP %@ | DZ %@ | READY %@ | IN %@ | REL %@";
